{
  "architectures": [
    "EncoderDecoderModel"
  ],
  "bos_token_id": 0,
  "decoder": {
    "_name_or_path": "facebook/bart-base",
    "activation_dropout": 0.1,
    "activation_function": "gelu",
    "add_bias_logits": false,
    "add_cross_attention": true,
    "add_final_layer_norm": false,
    "architectures": [
      "BartModel"
    ],
    "attention_dropout": 0.1,
    "classif_dropout": 0.1,
    "classifier_dropout": 0.0,
    "d_model": 768,
    "decoder_attention_heads": 12,
    "decoder_ffn_dim": 3072,
    "decoder_layerdrop": 0.0,
    "decoder_layers": 6,
    "dropout": 0.1,
    "dtype": "float32",
    "early_stopping": true,
    "encoder_attention_heads": 12,
    "encoder_ffn_dim": 3072,
    "encoder_layerdrop": 0.0,
    "encoder_layers": 6,
    "forced_bos_token_id": 0,
    "gradient_checkpointing": false,
    "init_std": 0.02,
    "is_decoder": true,
    "is_encoder_decoder": false,
    "max_position_embeddings": 1024,
    "model_type": "bart",
    "no_repeat_ngram_size": 3,
    "normalize_before": false,
    "normalize_embedding": true,
    "num_beams": 4,
    "num_hidden_layers": 6,
    "scale_embedding": false,
    "task_specific_params": {
      "summarization": {
        "length_penalty": 1.0,
        "max_length": 128,
        "min_length": 12,
        "num_beams": 4
      },
      "summarization_cnn": {
        "length_penalty": 2.0,
        "max_length": 142,
        "min_length": 56,
        "num_beams": 4
      },
      "summarization_xsum": {
        "length_penalty": 1.0,
        "max_length": 62,
        "min_length": 11,
        "num_beams": 6
      }
    },
    "use_cache": true,
    "vocab_size": 50265
  },
  "decoder_start_token_id": 0,
  "dtype": "float32",
  "encoder": {
    "activation_dropout": 0.0,
    "adapter_attn_dim": null,
    "adapter_kernel_size": 3,
    "adapter_stride": 2,
    "add_adapter": false,
    "apply_spec_augment": true,
    "architectures": [
      "Wav2Vec2Model"
    ],
    "attention_dropout": 0.1,
    "classifier_proj_size": 256,
    "codevector_dim": 256,
    "contrastive_logits_temperature": 0.1,
    "conv_bias": false,
    "conv_dim": [
      512,
      512,
      512,
      512,
      512,
      512,
      512
    ],
    "conv_kernel": [
      10,
      3,
      3,
      3,
      3,
      2,
      2
    ],
    "conv_stride": [
      5,
      2,
      2,
      2,
      2,
      2,
      2
    ],
    "ctc_loss_reduction": "sum",
    "ctc_zero_infinity": false,
    "diversity_loss_weight": 0.1,
    "do_stable_layer_norm": false,
    "dtype": "float32",
    "feat_extract_activation": "gelu",
    "feat_extract_norm": "group",
    "feat_proj_dropout": 0.1,
    "feat_quantizer_dropout": 0.0,
    "final_dropout": 0.0,
    "freeze_feat_extract_train": true,
    "hidden_act": "gelu",
    "hidden_dropout": 0.1,
    "hidden_size": 768,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-05,
    "layerdrop": 0.0,
    "mask_channel_length": 10,
    "mask_channel_min_space": 1,
    "mask_channel_other": 0.0,
    "mask_channel_prob": 0.0,
    "mask_channel_selection": "static",
    "mask_feature_length": 10,
    "mask_feature_min_masks": 0,
    "mask_feature_prob": 0.0,
    "mask_time_length": 10,
    "mask_time_min_masks": 2,
    "mask_time_min_space": 1,
    "mask_time_other": 0.0,
    "mask_time_prob": 0.05,
    "mask_time_selection": "static",
    "model_type": "wav2vec2",
    "no_mask_channel_overlap": false,
    "no_mask_time_overlap": false,
    "num_adapter_layers": 3,
    "num_attention_heads": 12,
    "num_codevector_groups": 2,
    "num_codevectors_per_group": 320,
    "num_conv_pos_embedding_groups": 16,
    "num_conv_pos_embeddings": 128,
    "num_feat_extract_layers": 7,
    "num_hidden_layers": 12,
    "num_negatives": 100,
    "output_hidden_size": 768,
    "proj_codevector_dim": 256,
    "tdnn_dilation": [
      1,
      2,
      3,
      1,
      1
    ],
    "tdnn_dim": [
      512,
      512,
      512,
      512,
      1500
    ],
    "tdnn_kernel": [
      5,
      3,
      3,
      1,
      1
    ],
    "use_weighted_layer_sum": false,
    "vocab_size": 32,
    "xvector_output_dim": 512
  },
  "eos_token_id": 2,
  "is_encoder_decoder": true,
  "model_type": "encoder-decoder",
  "pad_token_id": 1,
  "transformers_version": "4.56.1"
}
